openFoamRepoDev/tutorials/heatTransfer/buoyantSimpleFoam/roomWithThickCeiling/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    floor
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    ceiling
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
        inletValue      uniform (0 0 0);
    }

    outlet
    {
        type            fixedValue;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }

    fixedWalls
    {
        type            empty;
    }
}


// ************************************************************************* //
